# Tab

## Description
Procedure Tab writes a tab character to the current output file.

```pascal
PROCEDURE Tab(n : INTEGER);
```

```python
def vs.Tab(n):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|n|INTEGER|Number of tab characters to be written to file.|

## Examples
==== VectorScript ====
```pascal
Tab(2);
{writes two tabs to the output file}
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* File I@O